{
  "backend/main.mo": "Defines data models and storage maps for branches, semesters, subjects, notes, question papers, MCQs, syllabi, and user profiles, including search helpers and authorization hooks.",
  "feature_evidence.json": "Lists feature evidence entries mapping implemented features to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides brief descriptions of various frontend components, utilities, and pages for reference or documentation.",
  "frontend/index.css": "Defines Tailwind CSS base layer and custom light/dark theme variables for consistent UI styling.",
  "frontend/index.html": "Basic HTML entry file that mounts the React app and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for all major pages including home, branches, subjects, search, auth, admin, and MCQ practice.",
  "frontend/src/components/admin/ContentSetup.tsx": "Admin UI component for adding branches, semesters, and subjects with form handling and mutation hooks.",
  "frontend/src/components/admin/MCQManager.tsx": "Form UI for creating MCQs, including branch/semester/subject selection, options management, and submission via addMCQ mutation.",
  "frontend/src/components/admin/NotesManager.tsx": "Uploads notes with metadata like branch, semester, subject, year, and tags, handling file upload progress and calling addNotes.",
  "frontend/src/components/admin/QuestionPapersManager.tsx": "Handles uploading question papers with branch/semester/subject selection, year, exam type, and file upload progress.",
  "frontend/src/components/admin/SyllabusEditor.tsx": "Fetches and edits a subject’s syllabus overview, allowing admins to update or create syllabus content.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with a link to return home for unauthorized users.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Protects routes by checking admin status and showing loading or denial screens as needed.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Prompts authenticated users without profiles to input name and email, saving the profile via mutation.",
  "frontend/src/components/branches/BranchCard.tsx": "Clickable card displaying branch info and navigating to its detail page.",
  "frontend/src/components/common/EmptyState.tsx": "Reusable empty state component showing an icon, title, optional description, and optional action button.",
  "frontend/src/components/common/ErrorState.tsx": "Displays an error alert with a message and optional retry button.",
  "frontend/src/components/common/LoadingState.tsx": "Shows a centered loading spinner with an optional message.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main app layout with header, footer, routed content, profile setup dialog, and toaster.",
  "frontend/src/components/layout/Footer.tsx": "Renders the footer with current year, branding text, and a referral link.",
  "frontend/src/components/nav/Header.tsx": "Implements the app header with navigation, search bar, authentication controls, and mobile menu.",
  "frontend/src/components/search/GlobalSearchBar.tsx": "Provides a search input that navigates to the search page with the entered query.",
  "frontend/src/components/subject/MCQBrowser.tsx": "Displays subject MCQs with expandable cards, practice navigation, and admin delete actions.",
  "frontend/src/components/subject/NotesList.tsx": "Lists downloadable subject notes with metadata, tags, and admin deletion support.",
  "frontend/src/components/subject/QuestionPapersList.tsx": "Shows previous question papers with sorting, download functionality, and optional admin deletion.",
  "frontend/src/components/subject/SyllabusOverview.tsx": "Fetches and displays syllabus text or shows appropriate loading/empty/error states.",
  "frontend/src/data/branches.ts": "Defines static branch metadata and a helper to find branches by name.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity, handling access control and query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, handling identity loading, login, and logout states. Wraps AuthClient creation and exposes status flags and actions.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating backend data such as branches, semesters, subjects, notes, and question papers. Integrates with useActor to call canister methods and manages cache invalidation.",
  "frontend/src/index.css": "Sets up Tailwind CSS base styles and custom CSS variables for light and dark themes. Defines typography, utility classes, and global styling defaults.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge. Simplifies conditional Tailwind class composition.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with QueryClientProvider and InternetIdentityProvider. Mounts the App component and loads global CSS.",
  "frontend/src/pages/admin/AdminPanelPage.tsx": "Provides an admin interface with tabs to manage setup, notes, papers, MCQs, and syllabus content.",
  "frontend/src/pages/AuthPage.tsx": "Renders the authentication page with login/logout actions using Internet Identity. Displays user profile info and handles login state transitions.",
  "frontend/src/pages/BranchPage.tsx": "Displays branch details, available semesters, and subjects fetched from the backend. Handles loading states, errors, and semester selection UI.",
  "frontend/src/pages/HomePage.tsx": "Shows the home page with hero content, feature highlights, and a list of branches. Provides navigation entry points into branch-specific pages.",
  "frontend/src/pages/MCQPracticePage.tsx": "Renders an MCQ practice flow, handling question navigation, answer selection, result evaluation, and restart logic.",
  "frontend/src/pages/SearchResultsPage.tsx": "Displays search results for subjects, notes, question papers, and MCQs, with loading and empty states.",
  "frontend/src/pages/SubjectPage.tsx": "Shows subject details and tabs for notes, question papers, MCQs, and syllabus using query hooks.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the frontend.",
  "project_state.json": "Defines the project’s current state, goals, architecture notes, required images, and existing feature set for building a responsive online learning platform. Contains metadata, supported branches, UI/UX guidelines, and functional requirements for navigation, content structure, and authentication."
}